---
type: ComboBoxMemberData
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# ComboBoxMemberData

`Autodesk.Revit.UI.ComboBoxMemberData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ComboBoxMemberData | 2011 | `public ComboBoxMemberData ( string name , string text )` |
| Property | GroupName | 2011 | `public string GroupName { get ; set ; }` |
| Property | Image | 2011 | `public ImageSource Image { get ; set ; }` |
| Property | Text | 2011 | `public string Text { get ; set ; }` |